---
kind: property
id: P:Autodesk.Revit.DB.Electrical.AnalyticalEquipmentLoadData.Voltage
source: html/a0f13858-ff69-5a75-ffa7-6fee10044a9a.htm
---
# Autodesk.Revit.DB.Electrical.AnalyticalEquipmentLoadData.Voltage Property

The voltage of the analytical equipment load.

## Syntax (C#)
```csharp
public double Voltage { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentException** - When setting this property: The given value for voltage is not a number
 -or-
 When setting this property: The given value for voltage is not finite
- **Autodesk.Revit.Exceptions.ArgumentOutOfRangeException** - When setting this property: The given value for voltage must be positive.